#include <stdio.h>
#include <locale.h>


int main(void) 
{
	setlocale(LC_ALL, "RUS");
	// Задание 1 -------------------------------------------------------------------
	//int num1, num2;
	//
	//printf("Введите число 1:\n");
	//scanf("%d", &num1);
	//printf("Было введено число %d в качестве первого числа!\n\n", num1);
	//
	//printf("Введите число 2:\n");
	//scanf("%d", &num2);
	//printf("Было введено число %d в качестве второго числа!\n\n", num2);
	//
	//printf("Сумма чисел %d и %d равняется: %d\n", num1, num2, num1 + num2);
	//printf("Разность чисел %d и %d равняется: %d\n", num1, num2, num1 - num2);
	//printf("Произведение чисел %d и %d равняется: %d\n", num1, num2, num1 * num2);
	//printf("Частное чисел %d и %d равняется: %f\n", num1, num2, (num1 + 0.0) / num2);
	//printf("Частное чисел %d и %d равняется: %d\n", num1, num2, num1 % num2);
	// Задание 1 -------------------------------------------------------------------

	// Задание 2 -------------------------------------------------------------------
	//int dym;
	//float result;
	//
	//printf("Введите количество дюймов:\n");
	//scanf("%d", &dym);
	//
	//result = dym * 2.54;
	//printf("Количество сантиметров в введённых дюймах при расчёте в английских дюймах равно: %f см\n", result);
	//
	//result = dym * 2.32166;
	//printf("Количество сантиметров в введённых дюймах при расчёте в испанских дюймах равно: %f см\n", result);
	//
	//result = dym * 2.7076;
	//printf("Количество сантиметров в введённых дюймах при расчёте в старолитовских дюймах равно: %f см\n", result);
	// Задание 2 -------------------------------------------------------------------




	// ДЗ ---------------------------------------------------------------------------
	//int bar, gal;
	//
	//printf("Введите количество баррелей:\n");
	//scanf("%d", &bar);
	//
	//printf("Введите количество галлонов:\n");
	//scanf("%d", &gal);
	//
	//printf("Рассчёт введённых баррелей в килограммах равен: %f кг\n", bar * 136.4);
	//printf("Рассчёт введённых галлонов в килограммах равен: %f кг\n", gal * 3.7854);
	// ДЗ ---------------------------------------------------------------------------

}